#!/usr/bin/python3

"""
У вас есть строка. Со стандартного ввода подаются три индекса.
Получите символы на соответствующих местах и выведите их.
"""

# Задача
"""
word = "ABCDEFGHIJK"
i1 = int(input())
i2 = int(input())
i3 = int(input())

# Измените код ниже

print(word[0])
print(word[1])
print(word[2])
"""

# Решение
word = "ABCDEFGHIJK"
i1 = int(input())
i2 = int(input())
i3 = int(input())

# Измените код ниже

print(word[i1])
print(word[i2])
print(word[i3])
