#!/usr/bin/python3

"""
У вас есть строка. Со стандартного ввода подается индекс.
Получите символы на соответствующем месте и выведите его.

Пример вывода:
F
"""

# Задача
"""
word = "ABCDEFGHIJK"

index = int(input())
"""

# Решение
word = "ABCDEFGHIJK"

index = int(input())

print(word[index])