#!/usr/bin/python3

"""
Со стандартного ввода поступает слово.
Используя цикл range (max, min, − 1) или срезы [::-1], переверните слово.

Пример ввода:
океания

Пример вывода:
яинаеко
"""

# Задача
"""
word = input()
"""

# Решение
word = input()

print(word[::-1])

# for i in range(len(word), 0, -1):
#     print(word[i - 1], end='')
