#!/usr/bin/python3

"""
Со стандартного ввода поступает слово.
«Откусите» у него первую и последнюю буквы, затем выведите слово.

Пример ввода:
Океания

Пример вывода:
кеани
"""

# Задача
"""
word = input()
"""

# Решение
word = input()

print(word[1:-1])
