#!/usr/bin/python3

"""
Со стандартного ввода поступает слово.
Выведите все буквы после третьей.

Пример ввода:
Океания

Пример вывода:
ания
"""

# Задача
"""
word = input()
"""

# Решение
word = input()

print(word[3:])
