#!/usr/bin/python3
"""
Со стандартного ввода подаются 7 булевых значений для 7 дней недели,
где записано, учимся ли мы в очередной день.

Пример вывода:
Понедельник
Четверг
Пятница
"""

# Задача
"""
monday = input() == "True"
tuesday = input() == "True"
wednesday = input() == "True"
thursday = input() == "True"
friday = input() == "True"
saturday = input() == "True"
sunday = input() == "True"

# Начните писать код здесь

2_if monday:
    print("Понедельник")

2_if ...
"""

# Решение
monday = input() == "True"
tuesday = input() == "True"
wednesday = input() == "True"
thursday = input() == "True"
friday = input() == "True"
saturday = input() == "True"
sunday = input() == "True"

# Начните писать код здесь

if monday:
    print('Понедельник')
if tuesday:
    print('Вторник')
if wednesday:
    print('Среда')
if thursday:
    print('Четверг')
if friday:
    print('Пятница')
if saturday:
    print('Суббота')
if sunday:
    print('Воскресенье')
