#!/usr/bin/python3

"""
Денис живет в небольшом городе, мечтает стать программистом и работать в Apple.
Прямо сейчас Денис идет купить ноутбук в рассрочку, чтобы учиться кодить.
Впереди у Дениса и его ноутбука много приключений,
серьезного и совершенно нелепого кода, сотни просмотренных видео.
А пока Денис пишет простую программу, чтобы посчитать,
сколько придется платить каждый месяц за ноутбук. Напишите такую же программу.
"""

# Задача
"""
price = 50000 # цена ноутбука
months = 10 # количество месяцев
monthly_fee = ...

print(...)
"""

# Решение
price = 50000 # цена ноутбука
months = 10 # количество месяцев
monthly_fee = price / months

print(monthly_fee)

