#!/usr/bin/python3

"""
Денис старается пить не меньше трех литров воды в день.
Значит, в начале недели желательно заказать запас.
Девиз Дениса — никогда не используй калькулятор там, где можно использовать компилятор!
Напишите небольшую программу, которая посчитает, сколько воды необходимо на неделю.
"""

# Задача
"""
water_daily = 3
days = 7

water_total = ..
print(water_total)
"""

# Решение
water_daily = 3
days = 7

water_total = water_daily * days
print(water_total)
