#!/usr/bin/python3
"""
Допишите код так, чтобы слова выводились через запятую с пробелом.
Не используйте больше одной функции.

Пример вывода:
India, Julietta, Kilo
"""

# Задача
"""
print("Alfa","Bravo","Charlie","Delta","Echo")
"""

# Решение
print("Alfa", "Bravo", "Charlie", "Delta", "Echo", sep=", ")
