#!/usr/bin/python3

"""
Во времена космической гонки зародилась идея децентрализованной сети,
которая через несколько десятилетий стала Интернетом.
Сегодня тысячи строк кода запускают ракеты с космонавтами
на борту и опускают отделяемые ступени обратно на поверхность Земли.
А когда-то, когда программы были маленькими, а компьютеры большими,
всё началось с «5, 4, 3, 2, 1, поехали!».

Напишите программу, которая выводит:

5
4
3
2
1

Поехали!
"""

# Задача
"""
print("")
print("Поехали!")
"""

# Решение
print("5", "4", "3", "2", "1", "Поехали!", sep="\n")

