#!/usr/bin/python3

"""
Каждый день ведется наблюдение за погодой.
Посчитайте, сколько дней за неделю было солнечно, дождливо, пасмурно, и выведите.

Пример вывода:
Солнечных дней: 2
Пасмурных дней: 3
Дождливых дней: 1
"""

# Задача
"""
weather = ["солнечно", "дождливо", "пасмурно", 
         "солнечно", "дождливо", "дождливо", 
         "солнечно"]

days_sunny = 0
days_gloomy = 0
days_rainy = 0

for ... in ...:
  if ...

print(f"Солнечных дней: __")
print(f"Пасмурных дней: __")
print(f"Дождливых дней: __")
"""

# Решение
weather = ["солнечно", "дождливо", "пасмурно",
           "солнечно", "дождливо", "дождливо",
           "солнечно"]

days_sunny = 0
days_gloomy = 0
days_rainy = 0

for word in weather:
    if word == 'солнечно':
        days_sunny += 1
    elif word == 'пасмурно':
        days_gloomy += 1
    else:
        days_rainy += 1


print(f"Солнечных дней: {days_sunny}")
print(f"Пасмурных дней: {days_gloomy}")
print(f"Дождливых дней: {days_rainy}")
