#!/usr/bin/python3

"""
У вас есть список строк.
Соедините их в одну через «_» с помощью join() и выведите ее.

Пример вывода:
ALFA_BRAVO_CHARLIE_DELTA
"""

# Задача
"""
words = ["ALFA","BRAVO","CHARLIE","DELTA"]
"""

# Решение
words = ["ALFA","BRAVO","CHARLIE","DELTA"]

print('_'.join(words))