#!/usr/bin/python3

"""
Напишите программу, которая выведет все элементы из списка, каждый на отдельной строчке.
"""

# Задача
"""
words = ["Alpha", "Bravo", "Charlie", "Delta", "Echo", "Foxtrot"]

1_for ...
"""

# Решение
words = ["Alpha", "Bravo", "Charlie", "Delta", "Echo", "Foxtrot"]

for word in words:
    print(word)