#!/usr/bin/python3

"""
Выведите все элементы из предоставленного списка, по одному на каждой строке.
"""

# Задача
"""
kings = ['Генрих', 'Людовик', 'Фридрих', 'Ричард']
for ... in ...:
  print(...)
"""

# Решение
kings = ['Генрих', 'Людовик', 'Фридрих', 'Ричард']
for kin in kings:
    print(kin)
