#!/usr/bin/python3

"""
У вас есть список временных интервалов:

timespans = ["7-8", "8-9", "9-10", "10-11", "11-12", "12-13" ]

Со стандартного ввода вы получаете число N.

Верните первые N интервалов, выведите их.

Пример вывода:
["7-8", "8-9", "9-10"]
"""

# Задача
"""
timespans = ["7-8", "8-9", "9-10", "10-11", "11-12", "12-13" ]

n = int(input())

...

print(...)
"""

# Решение
timespans = ["7-8", "8-9", "9-10", "10-11", "11-12", "12-13" ]

n = int(input())

print(timespans[:n])
