#!/usr/bin/python3

"""
Создайте словарь, где хранится информация о количестве выпечки.
Ключами будут str, значениями — int.
Не используйте вывод на печать, код в конце задания сам всё проверит.

Булочки с яблоком — 4.
Конвертики с творогом — 7.
Крендельки с вареньем — 4.
"""

# Задача
"""
bakery = ...

# Не удаляйте код ниже: он нужен для проверки выполнения задания.

print(bakery.get(input()))
"""

# Решение
bakery = {
    'Булочки с яблоком': 4,
    'Конвертики с творогом': 7,
    'Крендельки с вареньем': 4
}

# Не удаляйте код ниже: он нужен для проверки выполнения задания.

print(bakery.get(input()))
