#!/usr/bin/python3

"""
Создайте словарь, где хранится информация о том, на какие курсы набирают студентов.
Ключи — str, значения — bool.

Python — да.
Java — да.
Kotlin — нет.
Rust — нет.
"""

# Задача
"""
courses = ...

# Не удаляйте код ниже: он нужен для проверки выполнения задания.

print(courses.get(input()))
"""

# Решение
courses = {
    'Python': True,
    'Java': True,
    'Kotlin': False,
    'Rust': False
}

# Не удаляйте код ниже: он нужен для проверки выполнения задания.

print(courses.get(input()))
