#!/usr/bin/python3

"""
Создайте словарь, где хранится информация о количестве студентов в разных группах.
Ключами словаря должны быть группы (int), значениями — количество человек в группе (int).

1 — 30
2 — 22
3 — 18
4 — 12
"""

# Задача
"""
groups = ...

# Не удаляйте код ниже: он нужен для проверки выполнения задания.

print(groups.get(int(input())))
"""

# Решение
groups = {
    1: 30,
    2: 22,
    3: 18,
    4: 12
}

# Не удаляйте код ниже: он нужен для проверки выполнения задания.

print(groups.get(int(input())))
