#!/usr/bin/python3
"""
Сложите три числа, выведите результат.
"""

# Задача
"""
n_1 = int(input())
n_2 = int(input())
n_3 = int(input())

result = ...

print(result)
"""

# Решение
print(int(input()) + int(input()) + int(input()))
