#!/usr/bin/python3
"""
Пользователь вводит сумму денег.
Выведите ее половину, четверть, десятую часть.
"""

# Задача
"""
summ = int(input())

# Половина
half = ... 
# Четверть
quarter = ...
# Десятая часть
decimal = ...

print("Половина", half)
print("Четверть", quarter)
print("Десятая", decimal)
"""

# Решение
summ = int(input())

# Половина
half = summ / 2
# Четверть
quarter = summ / 4
# Десятая часть
decimal = summ / 10

print("Половина", half)
print("Четверть", quarter)
print("Десятая", decimal)
