#!/usr/bin/python3
"""
В 1 мегабайте 1024 килобайта. Сколько килобайт в 6 мегабайтах?
"""

# Задача
"""
megabytes_count = 6
kilobytes_in_megabyte = 1024

result = ...

print(result)
"""

# Решение
megabytes_count = 6
kilobytes_in_megabyte = 1024

result = kilobytes_in_megabyte * megabytes_count

print(result)
