#!/usr/bin/python3
"""
Со стандартного ввода подаются два числа.
Если они равны, выведите True, иначе — False.

Пример вывода:
True, False
"""

# Задача
"""
first_number = int(input())
second_number = int(input())
"""

# Решение
first_number = int(input())
second_number = int(input())
print('True' if first_number == second_number else 'False')
