#!/usr/bin/python3

"""
Получите со стандартного ввода два числа Х и У.
С помощью конструкции for in range() выведите все числа, которые находятся между ними.

Пример вывода (для X = 2, Y = 7):
3
4
5
6
"""

# Задача
"""
x = 
y = 

for...

    print(...)
"""

# Решение
x = int(input())
y = int(input())

for i in range(x + 1, y):
    print(i)
