#!/usr/bin/python3

"""
Со стандартного ввода подается число X.
Используя конструкцию for in range(),
выведите последовательность чисел от 1 до X (не включая Х), каждое число на отдельной строке.

Пример ответа:
1
2
3
...
7
"""

# Задача
"""
x = ...

for ...
  print(...)
"""

# Решение
x = int(input())

for i in range(1, x):
    print(i)
