#!/usr/bin/python3

"""
У вас есть три списка. Запустите цикл и выведите на каждой строке значение по индексу из каждого списка.

Пример:
пт - это рабочий день, а вечером гулять.
вс - это выходной день, а вечером страдать.
"""

# Задача
"""
weekdays = ["пн", "вт", "ср", "чт", "пт", "сб", "вс"]
work = [True, True, True, True, True, False, False]
plans = ["за покупками", "отдыхать", "играть", "лениться", "гулять", "кутить", "страдать"]
"""

# Решение
weekdays = ["пн", "вт", "ср", "чт", "пт", "сб", "вс"]
work = [True, True, True, True, True, False, False]
plans = ["за покупками", "отдыхать", "играть", "лениться", "гулять", "кутить", "страдать"]

for i in range(len(weekdays)):
    work_day = None
    if work[i]:
        work_day = 'это рабочий день'
    else:
        work_day = 'это выходной день'
    print(f'{weekdays[i]} - {work_day}, а вечером {plans[i]}.')
