#!/usr/bin/python3

"""
С помощью конструкции for in range() выведите последовательность чисел от 0 до 100 с шагом в 10.

Пример вывода:
0
10
20
...
100
"""

# Задача
"""
for...

    print(...)
"""

# Решение
for i in range(0, 101, 10):
    print(i)
