#!/usr/bin/python3

"""
Используя конструкцию for in range(),
выведите список из 8 степеней числа 2.

Пример ответа:

1
2
4
...
128
"""

# Задача
"""
for ... in range():
  print(...)
"""

# Решение
for num in range(8):
    print(2**num)
