#!/usr/bin/python3

"""
Используя конструкцию for in range(),
выведите последовательность чисел от 0 до 7, каждое число на отдельной строке.

Пример ответа:
0
1
2
3
...
7
"""

# Задача
"""
for ... in range():
  print(...)
"""

# Решение
for num in range(8):
    print(num)
