#!/usr/bin/python3

"""
Напишите код, чтобы вывести список с помощью генератора списков.
"""

# Задача
"""
items = ["Alpha", "Bravo", "Charlie"]

[print(item) ... ]
"""

# Решение
items = ["Alpha", "Bravo", "Charlie"]

[print(item) for item in items]
