#!/usr/bin/python3

"""
Напишите код, чтобы вывести цифры от 0 до 5 с помощью генератора списков и range.
"""

# Задача
"""
[item ...]
"""

# Решение
[print(item) for item in range(6)]