#!/usr/bin/python3

"""
У вас есть три слова. Соедините их в одно и выведите его.

Пример вывода:
uberraschung
"""

# Задача
"""
word_1 = "arbeiter"
word_2 = "unfall"
word_3 = "versicherung"

result = ...
"""

# Решение
word_1 = "arbeiter"
word_2 = "unfall"
word_3 = "versicherung"

print(word_1, word_2, word_3, sep='')
