#!/usr/bin/python3

"""
Со стандартного ввода подается слово.
Выведите количество звездочек, соответствующее длине слова.

Пример ввода:
Кодер

Пример вывода:
*****
"""

# Задача
"""
word = input()
"""

# Решение
word = input()

print('*' * len(word))
