#!/usr/bin/python3

"""
У вас есть функция times_ten(number), которая получает число,
умножает его на 10 и выводит в консоль.
Вызовите эту функцию трижды с аргументами 5, 15, 155.

Пример вывода:
4
8
116
"""

# Задача
"""
def times_ten(number):
    print(number*10)

times_ten(5)
# Вызовите ту же функцию для 15
# Вызовите ту же функцию для 155
"""


# Решение
def times_ten(number):
    print(number * 10)


times_ten(5)
times_ten(15)
times_ten(155)
