#!/usr/bin/python3

"""
Функция hello выводит "HELLO_WORLD!". Вызовите ее.

Пример вывода:
HELLO_WORLD!
"""

# Задача
"""
def hello():
    print("HELLO_WORLD!")

# Вызовите функцию здесь
...
"""


# Решение
def hello():
    print("HELLO_WORLD!")


# Вызовите функцию здесь
hello()
