#!/usr/bin/python3

"""
Создайте список дней недели на русском языке.

Названия дней недели запишите с большой буквы.
"""

# Задача
"""
weekdays = ...


# Не удаляйте код ниже и не редактируйте его, он нужен для проверки

1_for day in weekdays: 
    print(day)
"""

# Решение
weekdays = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье']

# Не удаляйте код ниже и не редактируйте его, он нужен для проверки

for day in weekdays:
    print(day)
