#!/usr/bin/python3

"""
Создайте список номиналов монет и банкнот в рублях начиная от 1 рубля.

Храните числа, а не строки.

Информацию о монетах и банкнотах в рублях смотрите на сайте: https://www.banki.ru
"""

# Задача
"""
numbers = 

# Не удаляйте код ниже и не редактируйте его, он нужен для проверки

1_for number in numbers: 
    print(number)
"""

# Решение
numbers = [1, 2, 5, 10, 50, 100, 200, 500, 1000, 2000, 5000]

# Не удаляйте код ниже и не редактируйте его, он нужен для проверки

for number in numbers:
    print(number)
