#!/usr/bin/python3

"""
Выведите «Программа работает» 5 раз с помощью цикла while.
"""

# Задача
"""
i = 0
while i < 5:
    ...
    i += 1
"""

# Решение
i = 0
while i < 5:
    print('Программа работает')
    i += 1
