#!/usr/bin/python3

"""
Выведите числа от 1 до 10 (включительно) с помощью цикла while.

Пример вывода:
1
2
3
...
10
"""

# Задача
"""
i = ...
while ...:
    ...
    i += ...
"""

# Решение
i = 0
while i < 10:
    print(i + 1)
    i += 1
