#!/usr/bin/python3

"""
Выведите числа от 0 до 100 (включительно) с шагом в 10 с помощью цикла while.

Пример вывода:
0
10
20
30
...
100
"""

# Задача
"""
i = ...
"""

# Решение
i = 0
while i <= 100:
    print(i)
    i += 10

