#!/usr/bin/python3

"""
У нас есть список fruits. Выведите принтом количество элементов в нем.

Пример вывода:

В списке элементов: 5
"""

# Задача
"""
fruits = ["banana", "orange", "apple"]

print()
"""

# Решение
fruits = ["banana", "orange", "apple"]

print(f'В списке элементов: {len(fruits)}')
