#!/usr/bin/python3

"""
У вас есть список фруктов. Напишите код, который выведет грушу.
"""

# Задача
"""
fruits = ["яблоко", "груша", "ананас", "апельсин", "виноград"]

element = …

print(element)
"""

# Решение
fruits = ["яблоко", "груша", "ананас", "апельсин", "виноград"]

element = fruits[1]

print(element)
