#!/usr/bin/python3

"""
Со стандартного ввода поступает фраза.
Посчитайте, сколько раз в ней встречается слово «если».
Выведите ответ числом.

Пример ввода:
если «если» перед «после», значит, «после» после «если»

Пример вывода:
3

Пример ввода:
значит, «после» перед «если»

Пример вывода:
1
"""

# Задача
"""
words = input()
"""

# Решение
words = input()

print(words.count('если'))