#!/usr/bin/python3

"""
Со стандартного ввода поступает фраза.
Посчитайте, сколько раз в ней встречается буква «р». Выведите ответ числом.

Пример ввода:
Краб крабу сделал грабли

Пример вывода:
3
"""

# Задача
"""
line = input()
"""

# Решение
line = input()

print(line.count('р'))