#!/usr/bin/python3

"""
Со стандартного ввода поступают два слова, разделенные пробелом.
Замените пробел на нижнее подчеркивание.

Пример ввода:
python coder

Пример вывода:
python_coder
"""

# Задача
"""
words = input()
"""

# Решение
words = input()

new_words = words.replace(' ', '_')
print(new_words)