#!/usr/bin/python3

"""
Со стандартного ввода подается строка.
Выведите количество единиц в ней.
Вы можете решить это задание перебором или использовать функцию count().

Пример ввода:
B1C1C1E

Пример вывода:
3
"""

# Задача
"""
line = input()
"""

# Решение
line = input()

print(line.count('1'))