#!/usr/bin/python3
"""
Пользователь вводит со стандартного ввода строку.
Если пользователь ввел bird, программа выводит «это птица».
Если пользователь ввел plane, программа выводит «это самолет».

Пример вывода:
это птица, это самолет
"""

# Задача
"""
# Получаем данные от пользователя
user_input = input()

# Проверяем первый вариант
2_if ...
    print(...)

# Проверяем второй вариант
...
    print(...)
"""

# Решение
# Получаем данные от пользователя
user_input = input()

# Проверяем первый вариант
if user_input == 'bird':
    print('это птица')

# Проверяем второй вариант
if user_input == 'plane':
    print('это самолет')
