#!/usr/bin/python3

"""
У вас есть строка.
Выведите ее с помощью цикла по одной букве на каждой строке.

Пример вывода:
M
E
O
W
"""

# Задача
"""
word = "PYTHONIC"
"""

# Решение
word = "PYTHONIC"

for letter in word:
    print(letter)
